Repository: henyee/NBDYSJCT
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 麦格拔开瓶塞，然后在两个酒杯里倒上酒。
en_us: Mag pulled out the cork, and poured it into two glasses.

source: 麦格拦了一辆马车，和车夫说了一声，直奔城西书坊。
en_us: Mag hailed a horse-drawn carriage. He gave the coachman instructions, and they headed straight for the books square in the west of the city.

source: 麦格拿着奖杯来到秋千前。
en_us: Mag went to the swing with the trophy.

source: 麦格拿着特制的小酒盅出门，手里还拿着一个铁制的小笼子，将小酒盅放在笼子里，挂上一把小锁，这才把它挂在门口的柱子上。
en_us: Mag took the specially made liquor holder out with a small iron cage. He placed the little liquor holder into the cage, and put on a small lock before hanging it on the pillar in front of the door.

source: 麦格挑眉，这场面，就像是一群黄铜无畏的冲向王者，令人肃然起敬。
en_us: Mag raised his eyebrows. This scene was equivalent to a bunch of noobs rushing towards a king. It was admirable.

source: 麦格挤出了一点勉强的笑容，无懈可击的答复。
en_us: Mag made a forced smile. It was an impeccable answer.

source: 麦格掀开车帘走了出来，看着面前崭新的绿色房子和画满了图画的围墙，脸上露出了笑容。
en_us: Mag flipped the carriage's covers, and walked out. Looking at the brand-new green house and walls that were covered in drawings, a smile appeared on Mag's face.

source: 麦格接着去了一趟纺织厂，见了艾许莉。
en_us: Next, Mag went to the textile factory and met up with Ashley.

source: 麦格接过画册翻开，里边果然是美人鱼的故事。
en_us: Mag took the picture book, and flipped it open. It was indeed the story of "The Little Mermaid."

source: 麦格推断道：“我推测那可能是一个更高等级的文明，他们有着更强大的实力和武器，但他们选择隐藏起来，没有在诺兰大陆上现身，甚至在所有典籍上都找不到他们的踪迹。”
en_us: Mag speculated, "I think it might be an even more advanced civilization. They are even more powerful and have better weapons. However, they chose to hide and did not appear in the Norland Continent. We coul dnot even find traces of them in the classical books."

source: 麦格提着一个菜篮子从菜市回来的时候，‘偶遇’了已经跟了他三条街的埃菲。
en_us: When Mag returned from the market with a basket, he "bumped" into Eiffie who had been following him for three blocks.

source: 麦格提着剑站起身来，看着那熟悉的面孔，神情有些复杂。
en_us: Mag stood up with his sword in his hand, looking at that familiar face with mixed feelings.

source: 麦格提着食盒进门，一边随口道：“对了，今天许愿井要是灵验的话，就让它送我们一台车吧，最好是全地形的那种，这样买菜就方便了。”
en_us: Mag brought the lunchbox in and said, "Oh, right, if the wishing well works, let's make it give us a vehicle, best if it's an all-terrain vehicle. That way, it would be more convenient for grocery shopping."

source: 麦格搀着伊琳娜下楼来，诺亚快步上前。
en_us: When Mag and Irina arrived, Noya quickly went up to them.

source: 麦格摇头道：“不，是一个从地底深处挖出来的破旧装备仓，里边有少量的机械和一些零散的书本，其中包括那台印刷机。”
en_us: Mag shook his head, "No. I got it from an old equipment bay that I dug out deep underground. There was some machinery and books in it, including that printing machine."

source: 麦格摇头，表情肃然道：“我不会将她的任何东西交给你们，也希望你们不要试图打她的主意，否则，就算是神，我也杀给你看。”
en_us: Mag shook his head and solemnly said, "I won't hand any part of her to you and I hope you guys will stop having designs on her. Otherwise, I will kill you even if you are a God."

source: 麦格摸了摸她的小脑袋道：“这次不行，那个坏蛋很危险，等艾米再长大一些，变得更强大了，就可以去了。”
en_us: Mag caressed her head and said, "Not this time. This bad egg is very dangerous. Amy can go when you are older and stronger."

source: 麦格撇了撇嘴，手里的菜刀晃了晃，思索着这家酒馆还要不要。
en_us: Mag pressed his lips together. He swung the cleaver in his hand, and decided that he would not want this tavern anymore.

source: 麦格收了两个水杯，准备去研究一下酿酒，门外又响起了铃铛声。
en_us: Mag kept the two water glasses, and was going to go study up on the brewing when the doorbell rang again.

source: 麦格收回目光，径直走向一旁的任务兑换厅。
en_us: Mag looked away and went to the mission exchange hall at the side.

source: 麦格收回脚，有些鄙夷的看着惨叫的巨汉。
en_us: Mag retracted his foot and looked at the crying man in despise.

source: 麦格收回脚，转身看着来人。
en_us: Mag retracted his leg and turned to look at the person.

source: 麦格放下了手里的古籍，问道：“这代表着什么？”
en_us: Mag placed the ancient book downa nd asked, "What does this mean?"

source: 麦格放下手中还剩下小半杯的酒，看着诺亚道：“明早过来吃早餐，事情明天再谈。”
en_us: Mag put down his Maotai, which still had half of a small cup left, and said to Noah, "Come and have breakfast tomorrow morning. We'll talk about it tomorrow."

source: 麦格放下手里的书，表情略显不自然。
en_us: Mag put his book down with an unnatural expression.

source: 麦格放下画册，看着安妮沉吟道：“不过，要是中间能够再加入一个小王子给小美人鱼做菜的环节就好了，这样就可以解释为什么小美人鱼会爱上小王子，并且爱的如此深刻的问题。”
en_us: Mag put down the picture book, and lamented to Annie, "However, if only we could add a scene whereby the prince cooks for the little mermaid, it would then explain why the little mermaid fell in love with the prince and why she loves him so much."

source: 麦格放下酒杯，说道：“酒味寡淡，适口性极差，香味混乱，而且很快便消散，没有回味。”
en_us: Mag placed the glass down and said, "The wine is tasteless and had a very distorted fragrance which disappeared quickly and there was no lingering taste."

source: 麦格无意多干涉埃菲的生活，看着伊琳娜微笑着问道：“品酒大会的重头戏已经结束了，一会还有一场宴席，我们是吃了回去，还是回去吃？”
en_us: Mag didn't want to interfere in Eiffie's life. He turned back and smilingly asked Irina, "The highlight of the liquor tasting event was already over. There's a banquet afterwards. Shall we go for our meals, or return home for our meals?"

source: 麦格昂首挺胸，嘴角挂着一丝成功人士的笑容。
en_us: Mag puffed out his chest with a successful man's smile on his face.

source: 麦格最后一把烤肉串给了工作人员们，也算是对他们的帮忙表示感谢。
en_us: Mag gave the last kebabs to the staff members as a gesture of appreciation for their help.

source: 麦格最终还会成功买到了四本杂志，也算是为自己应援了一波。
en_us: Eventually, Mag managed to buy four magazines. It was also considered as supporting himself.

source: 麦格最近没别的爱好，就喜欢在客人喝醉之后凑上去和他们瞎聊几句，比如昨天晚上刚被他们弄死的布卢姆，比如最近官场的大人们心情如何，对乔修有什么看法啊。
en_us: Recently, Mag did not have any hobbies other than listening to drunk customers and chatting with them. For example, about Blum, who was killed by him and Irina, or about how the courtiers were feeling recently and what they thought of Josh.

source: 麦格有些兴奋，感觉自己好像即将接触到这个世界的本质，就像当年麦哲伦证明世界是圆的时候一样。
en_us: Mag was getting a little excited. He felt that he seemed to have touched the essence of this world, just like how Ferdinand Magellan proved that the world was round.

source: 麦格有些失望。
en_us: Mag was slightly disappointed.

source: 麦格有点心虚，不过看着相对而坐的两人，气氛好像比他预想中的更和谐一点。
en_us: Mag felt a little guilty, but the ambiance between the two people sitting across from each other seemed better than he had anticipated.

source: 麦格有点惊讶的低头看了一眼伊琳娜挽着自己的手，这宣示主权的小动作，还挺可爱。
en_us: Mag looked down on Irina's arm wrapped around his in shock. This little move of proclaimation was rather cute.

source: 麦格有点惊讶道：“哦？小米还做了这样有趣的梦呢，那笑话大王和你说了什么好笑的笑话呢。”
en_us: Mag said with surprise, "Oh? Little Amy had such a funny dream. What funny jokes did that king of jokes told you?"

source: 麦格有点无辜，他只是实事求是而已。
en_us: Mag was rather innocent. He was only stating facts.

source: 麦格本以为这是一只被克苏鲁控制了的十级魔兽，获得了一部分魔化之后的能力，包括快速自我修复能力。
en_us: Mag thought it was a 10th-tier magic beast that was controlled by Cthulhu and had received some power it was devilized, including rapid self-healing power.

source: 麦格查看了一遍菜谱，便大概知道路上买的绿豆糕问题处在碾压绿豆的那道工序上，这一步做的太过粗糙，导致出现了一些漏网之鱼，而且刚刚吃的绿豆糕里有许多绿豆皮，所以口感也要更差一些。
en_us: Mag checked the recipe, and knew that the problem with the mung bean cake he bought had to be related to the process of squashing the beans. The owner had surely been careless with squashing the beans, so some of them were not squashed, and there were many mung bean skins in the pastry on top of that. That also made the texture of the pastry bad.

source: 麦格正准备关上门，一道尖细的哨声响起，一封信从远处飞来，从门缝处飞了进来，被麦格接住。
en_us: Mag was about to close the door when a sharp whistle sounded, and a letter flew over from afar. It flew in through the door's crack, and Mag caught it.

source: 麦格正准备退出，却看到那坐标图闪烁了几下，出现了一个微弱的红点，不过很快消失，但还是留下了一个坐标。
en_us: Mag was about to exit from the map when the pin started to blink and a faint red dot appeared. however, it vanished very quickly. Even so, a location was left behind.

source: 麦格沉吟良久，道：“纸片人嘛，要尽量满足读者的想象，像不像我，其实没那么重要。”
en_us: Mag hemmed and hawed for a long time before saying, "It's just a sketch, so it has to satisfy the readers' imagination. It doesn't matter that it doesn't look like me."

source: 麦格沉声喝道，人剑合一，旋转着向上飞去。
en_us: With a shout, Mag and the Tian Du sword merged as one and as they spiralled upwards.

source: 麦格沉默了。
en_us: Mag fell silent.

source: 麦格沉默了一会，看着梅兰特道：“也就是说，乔修可能控制了这个地方的古尸，让他们变成了能够驱使的仆从。”
en_us: Mag was silent for a while for saying to Merante, "Which means Josh might have controlled the ancient corpses here and transformed them into his servants."

source: 麦格没想到自己突破了十级的桎梏之后，再次遇上兰克斯特，依旧和他打了个五五开。
en_us: Mag did not expect that after he broke through the 10th-tier, he would meet Rankster again and still be on par with him.

source: 麦格没有在酒馆里呆太久，主要是和系统讨论酒馆装修的问题，一百五十平左右的小酒馆，相比于餐厅并不需要过大的厨房，酒窖也可以放在二楼，倒也能够容纳不少客人了。
en_us: Mag didn't stay in the tavern for too long. He was mostly discussing with the system about the tavern's renovation. The 500 square meters big tavern didn't need a big kitchen compared to a restaurant, and its cellar could be placed on the second floor. That layout could accommodate many customers.

source: 麦格没有急着上楼，他今晚也有许多事情要做。
en_us: Mag didn't rush to go upstairs. He still had many things to do tonight.

source: 麦格没有急着回酒馆，而是去了一趟肖恩的府邸。
en_us: Mag was not in a rush to return to the tavern. Instead, he went to Sean's mansion.

source: 麦格没有急着走，而是做了一顿丰盛的早餐，等到餐厅众人都到齐了，才宣布了歇业一个月的消息。
en_us: Mag wasn't in a hurry to leave. Instead, he prepared a sumptuous breakfast, and announced the news of the restaurant's one-month break after everyone arrived.

source: 麦格没有急着走，而是看着梅兰特和诺亚道：“这里是洛都，说十级满地跑有点夸张，但绝不是荒山野岭可比的，你们行事必须小心，要是被盯上，可就难办了。”
en_us: Mag was not in a hurry to leave. He looked at Merante and Noya as he said, "This is Rodu. It might be an exaggeration to say that the roads are filled with 10th-tiers, but there are definitely more of them than in the mountains. Be careful in whatever you do. If they set eyes on you, things would be difficult."

source: 麦格没有答话，让车夫前往罗莫街。
en_us: Mag did not reply as the coachman drove the carriage towards Romo street.

source: 麦格没有膨胀，所以他决定以后的日子，活的更像一个土著。
en_us: Mag was not ahead of himelf so he decided to live like a mole in the coming days.

source: 麦格没有顺利在菜单上加入拍黄瓜，因为这份拍黄瓜尚未达到系统的要求。
en_us: Mag did not add the Smashed Cucumber Salad successfully onto the menu as this Smashed Cucumber Salad still had yet to reach the system's requirement.

source: 麦格泡了壶茶，倒了一杯放在手边，手里拿着一本异常魔兽异闻录悠闲的看着。
en_us: Mag made a pot of tea and poured himself a cup. He was reading a book about abnormal magic beasts.

source: 麦格淡定的看着他道：“这其实并不是我应该考虑的问题，就算我愿意串联各族结成一个应对魔鬼和亡灵军团的联盟，最终能够做决定的依旧是你们这些掌权者。”
en_us: Mag looked at him calmly and said, "This is actually not what I shoudl be thinking about. Even if I wish to connect all races to form an alliance against the Devil and the Army of the Dead, the final decision would still ultimately fall on the hands of you people in power."

source: 麦格清点了一下埃菲的酒窖，十二个酒窖，按照时间来区分，每一个酒窖藏酒约三百桶。
en_us: Mag made an inventory of Eiffie's cellars. There were a total of 12 cellars and they were differentiated by their time. Every cellar held about 300 barrels.

source: 麦格游走于两个烤架之间，一把烤羊肉串，一把烤牛肉串，几乎同时完成出炉，放入两个金属长盘中。
en_us: Mag walked between the two grills. Both sets of mutton kebabs and beef kebabs were completed at the same time, and were placed on two long metal plates.

source: 麦格满足的笑了笑，也是夹了一块鹅肉吃了起来。
en_us: Mag smiled with satisfaction. He picked up a piece of goose meat and tried it.

source: 麦格点了点头：“或许我该找时间去一趟洛都了，时间拖得越久，他只会变得越强，等到他被旧日支配者彻底代替的时候，恐怕为时已晚了。”
en_us: Mag nodded. "Perhaps I should find some time to go to Rodu. He will only become more and more powerful as this drags out. It will be too late when he is completely taken over by the Great Old One."

source: 麦格点头，艾略特是莎莉的父亲，但他杀了雪莉尔的父亲，这个仇恨是无法化解的。
en_us: Mag nodded. Elliot was Shirley's father. If he killed Shirley's father, there would be no end to this hatred.

source: 麦格点头：“是的，古老者对于魔鬼的气息似乎有独特的探查方法，她一眼就看出了安妮的不同，并且提出要将安妮带回去研究的要求。”
en_us: Mag nodded. "Yes. The Elder Things seemed to have a unique way of seeking out the Devil's aura so she could tell straightaway that Annie was different. She even wanted to bring Annie back for research."

source: 麦格点开面食大礼包，里边有：灌汤包、刀削面、热干面、红油抄手！
en_us: Mag clicked open the cooked wheaten food gift package which contained: soup dumplings, shaved noodles, hot noodles with sesame paste, and Sichuan spicy wonton in red oil!

source: 麦格点点头道：“等会我去小睡一会，然后出发再去北边，找一个适合地方布置封印阵法。”
en_us: Mag nodded and said, "Let me nap for while before we set off for the north. We'll find a place suitable for setting up the seal spell formation."

source: 麦格点点头，也是多看了几眼鲍里斯。
en_us: Mag nodded. He also stole a few glances at Boris.

source: 麦格点点头，又道：“你有什么不共戴天的仇家吗？会在黑市买你命的那种？”
en_us: Mag nodded and said, "Do you have any arch enemies? The kind that would pay to have you killed in the black market?"

source: 麦格点点头，消息一旦传开的确会有更多的人赶来，看着费奇道：“这样吧，你把资料留下，我看看有没有合适的商家，晚点再通知你。”
en_us: Mag nodded. There would indeed be more people asking about it once the news spread. He said to Fitch, "Why don't you leave the information here. I'll see if there are any suitable businesses. I'll let you know later."

source: 麦格烤制的速度越来越快，完全跟上了工作人员发放的速度。
en_us: Mag's grilling speed became faster and faster, keeping up perfectly with the staff members' distribution speed.

source: 麦格特意选了一家还算热闹的书店，就是想看看食全食美的知名度，是否真有那两个家伙吹嘘的那么强。
en_us: Mag deliberately chose a bookshop that was rather boisterous so that he could see for himself if the Perfect Food was indeed as popular as those two chaps said.

source: 麦格用了半小时的时间，向费奇转达了系统设计的罗莫街商业分布和组成，以及让费奇吃惊的租金价格。
en_us: Mag used 30 minutes to convey to Fitch the distribution and composition of businesses that the system designed and the rental that shocked Fitch.

source: 麦格用筷子夹起一只灌汤包，原本扁圆的灌汤包一提起就变成了灯笼般圆润的模样，汤汁满满，却没有爆开。
en_us: Mag picked up a soup dumpling with a pair of chopsticks. The flat soup dumpling immediately became round like a lantern. The soup filled the dumpling up but it did not explode.

source: 麦格用筷子戳了一下皮蛋酥的表皮，的确已经变硬了，点点头道：“那就可以吃了。”
en_us: Mag used the chopsticks to poke the skin of the pastry. It had already hardened. He nodded, and said, "We can eat it now."

source: 麦格略一思索道：“两种可能，一是海伦娜已经意识到自己的政策和方向错误，打算痛改前非，从此做一个好人，并将政策逐渐扭转。
en_us: After pondering briefly, Mag said, "There are two possibilities. The first is that Helena has already realized her direction and policy are wrong, and she decided to rectify her mistakes. She is going to be a good person from now on, and slowly turn the policy around.

source: 麦格略一思索道：“完全随机的目标，更能制造恐慌，以及让对手陷入毫无头绪的调查。”
en_us: After pondering for a brief moment, Mag replied, "A completely random target can create even more panic, and give the opponent no way to investigate."

source: 麦格略一思索道：“说是人是鬼都行。”
en_us: Mag thought for a while, and said, "You can say he's both."

source: 麦格略一思索道：“首先你需要找到自己的定位，恢复供应正宗的陈酿泰坦酒的泰坦酒馆，定位应当是洛都城里最顶级的酒馆，所以你说面向的也应该是最有钱和最有价值的那一批客人。
en_us: Mag thought for a while and said, "First, you need to find your place. To restore the glory of Titan Tavern's Titan Liquor, you would need to eye for the best tavern in Rodu. Therefore, you are also targetting the wealthiest and most valuable batch of customers.

source: 麦格略一迟疑道：“他是我的一位朋友，如果你找到他的话，哪怕是最糟糕的情况，也希望能够让我再见他一面。”
en_us: After a brief interaction, Mag said, "He's a friend of mine. If you found him, I hope I can meet him even if it's the worst situation.

source: 麦格的厨神之路，也是蹭蹭连升两级。
en_us: Mag's path to become the God of Cookery had also risen by two levels.

source: 麦格的声音有些冷，心也有些冷。
en_us: Mag's voice was cold, and his heart was cold too.

source: 麦格的实力毋庸置疑，已经超出十级的范畴，虽然还不能称神，但也不是十级能够比拟。
en_us: There was no doubting Mag's powers. He had already exceeded the limit of the 10th-tier. Although he could not be considered a god, he was still not somewhere a 10th-tier could go close to.

source: 麦格的心已经降到了冰点。
en_us: Mag's heart dropped to the freezing point.

source: 麦格的心情多少有些复杂，有英雄相惜的感叹，也有对伊丽莎白的惋惜。
en_us: Mag had mixed feelings. He lamented the loss of a great hero and Elizabeth's loss of her father.

source: 麦格的想法很简单，杀死更多的亡灵军团，以及让更少的联军死去。
en_us: Mag's idea was simple. The more Army of the Dead they could kill would lessen the allied forces' casualties.

source: 麦格的手向前一指，天都剑化作一道残影射入幽幽通道之中，将通道中涌来的古尸尽皆斩杀。
en_us: Mag pointed skywards and the Tian Du sword shot into the walkway like a shadow. All the ancient corpses in the walkway were slaughtered.

source: 麦格的手微微一僵，这么久了，她终于还是对冰箱里莫名出现，取之不尽的食材产生怀疑了吗？
en_us: Mag's hands froze in midair. She finally had suspicions about the inexhaustible ingredients that appeared in the fridge mysteriously after so long?

source: 麦格的目光扫了一眼安德烈侧后方的阴影，眉头微皱，很快恢复淡定。
en_us: Mag glaned at the shadow behind Andre. He furrowed his brows but quickly regained his composure.

source: 麦格的目标是那个十级骑士，而杀死布卢姆的任务则交给了特效大师和光影大师伊琳娜，由她来为布卢尔呈现一场由麦格导演的大型恐怖片。
en_us: Mag's target was the 10th-tier knight, and killing Blum would be left to Irina, the master of special effects and lighting. She would be the one presenting the large-scale horror film directed by Mag to Blum.

source: 麦格的眼皮则狂跳了几下，这又是闹哪出？
en_us: Mag's eye twitched a few times. What's going on now?

source: 麦格的眼皮狂跳了几下，那是一把比巴雷特更为夸张地重狙，硬朗的线条，犹如能够吸收光线的幽暗光泽。
en_us: Mag's eyelids twitched a few times. That was a bullpup assult rifle that was even more exaggerated that the Barrett. Its hard lines seemed to be able to absorb the dark glow of the light.

source: 麦格的确有些被惊艳到了。
en_us: Mag was indeed shocked.

source: 麦格的精神力很强，比这个世界大部分人都强，包括一些十级大魔法师。
en_us: Mag's spiritual power was very strong. It was much stronger than most people in this world, including some 10th-tier great magic casters.

source: 麦格的表情顿时僵住，他刚刚才信誓旦旦的说后院的蜗牛绝对不能吃，现在却要带艾米去后院找能够食用的蜗牛吗？
en_us: Mag's expression froze on his face. He'd just said that the snails in the back yard were absolutuely inedible earlier and now he had to bring Amy to go look for edible snails in the back yard?

source: 麦格的这番操作，把桌上众人有些看呆了去，甚至都忘了动筷。
en_us: Everyone was so stunned watching Mag eat that they forgotto eat.

source: 麦格目送埃菲离去，看着大门在她身后缓缓关闭，松了口气。
en_us: Mag watched Eiffie leave and closed the door gently behind her. He let out a sigh.

source: 麦格盯着那竖瞳，目光似乎变得有些呆滞。
en_us: Mag stared at those vertical pupils, his gaze seemed to have turned slightly lost.

source: 麦格眉头一皱，发现事情并不简单，这笔投资，怕是要亏成翔。
en_us: Mag frowned. He realized that things did not seem so simple. He might be making a loss in this investment.

source: 麦格眉头微皱，感觉这个家伙就像是一个人形的系统，古板而冷漠。
en_us: Mag frowned slightly. He felt that this fellow was just like a humanoid system. She was rigid and cold.

source: 麦格眉头微皱，然后面不改色的把那本杂志放下，“看来是一场颇为惨烈的战斗。”
en_us: Mag frowned slightly before putting that magazine down calmly. "Sounds like a heated battle."

source: 麦格眉梢一挑，顿时多了几分紧张。
en_us: Mag raised his brow. He was suddenly a little nervous.

source: 麦格眉梢微挑，嘴角疯狂上扬。
en_us: Mag raised his brow and smiled widely.

source: 麦格眉梢微挑，微微点头，果然还是要有个有威严的母亲才行。
en_us: Mag raised his eyebrows and nodded slightly. They indeed needed an authoritative mother.

source: 麦格看了一眼上边的灰神殿火漆，关上了门，拆开信封。
en_us: Mag flicked a glance at the Gray Temple's wax seal before closing the door, and opening the envelope.

source: 麦格看了一眼埃菲，倒是更能理解这个女人的不易了。
en_us: Mag flicked a glance at Eiffie. He had a better understanding of this woman's difficulties.

source: 麦格看了一眼她的手，又是看了看她，莫非这点小事就要他牺牲色相？
en_us: Mag glanced at her hand, and then at her. Did she want him to sell himself over this little thing?

source: 麦格看了一眼她的折叠椅，眉梢微挑，这母女俩的喜好倒是非常相近。
en_us: Mag flicked a glance at the folding chair and raised his eyebrows. The mother and daughter had similar tastes.

source: 麦格看了一眼散落在地上的龙币和金币，微笑着走上前，一脚踩住了那巨汉试图再次握住板斧右手。
en_us: Mag looked at the dragon coins and gold coins scattered on the floor and went forward with a smile. He stepped on that big guy's hand that was grabbing the axe's handle again.

source: 麦格看了一眼老板拿给他的那本画本：骑龙勇士魔穴大战美杜莎！
en_us: Mag looked at the storybook that the boss passed to him: Dragon-riding warrior battles Medusa in a demonic cave!

source: 麦格看了一眼被反锁的门，又看着向他走来的伊琳娜，他觉得今晚肯定会发生点什么。
en_us: Mag looked at the locked door and Irina who was walking towards him. He felt something was definitely going to happen tonight.

source: 麦格看了一眼那堆成小山一般的大肥鹅，一只差不多有十斤重了，这可是三百多斤的鹅，而且还是活的。
en_us: Mag flicked a glance at the big, fat geese that piled up at the side. Every goose was about five kilograms heavy, so there were about 150 kg of geese here. Furthermore, they were alive.

source: 麦格看了她一眼，一般人可不会觉得正常。
en_us: Mag glanced at her. Normal people wouldn't find it normal.

source: 麦格看了她一眼，同样微笑道：“虽然你长得很美，但你也想得太美了。”
en_us: Mag flicked a glance at her and also smilingly said, "Although you are pretty, don't harbor too pretty thoughts."

source: 麦格看得出费奇的想法，但对方态度友好，业务能力也不差，也就值得合作，其他的想法根本没有被他放在心上。
en_us: Mag could see through Fitch's thinking, but his attitude was good and his abililty was not bad, so he was willing to work with him. He didn't care about his other thoughts.

source: 麦格看着一片空白的坐标。
en_us: Mag looked at the empty empty map.

source: 麦格看着两人，这种天气，骑着毫无防风功能的铁背鹰在山里飞两天，的确有的受了。
en_us: Mag looked at the two of them. It was indeed tough to fly in the mountains for two days on a steel eagle with no wind-blocking abilities in this weather.

source: 麦格看着伊丽莎白，人是他从龙岛救回来的，进入餐厅工作算是意外，但这段时间的相处，每天一起吃饭工作，感情肯定是有一些的。
en_us: Mag looked at Elizabeth. He had saved her from Dragon Island, and it was purely an accident that she ended up working in the restaurant. However, after working and eating together for this period of time, they definitely formed a friendship.

source: 麦格看着伊琳娜，眉梢微挑。
en_us: Mag looked at Irina and raised a brow.

source: 麦格看着后院停着的那辆缩小版山地摩托，眉头微皱。
en_us: Mag frowned when he saw the two mini motorcycles parked at the backyard.

source: 麦格看着在视线中快速远去的冰原上升起的蘑菇云，松了口气，竟是有种劫后余生的感觉。
en_us: Mag looked at the mushroom cloud that rose up on the plain as they retreated rapidly and heaved a breath of relief. He felt he had just escaped from death.

source: 麦格看着埃菲受伤的表情，也意识到自己好像不小心暴露了本性，连忙安慰道：“当然，可能罗莫街上的其他酒馆的酒比这更差。”
en_us: Mag looked at the hurt Eiffie and realised he seemed to have accidentally revealed his true nature. He quickly comforted her saying, "Of course, the wines from the other taverns on Romo street might be even worse."

source: 麦格看着埃菲恳切而认真的目光，略一迟疑，还是点头道：“我其实也不太懂酿酒，不过要是埃菲小姐信得过我，我还是可以喝一点的。”
en_us: Miss saw the seriousness in Eiffie's pleading eyes and hesitated. In the end, he nodded and said, "Actually, I'm not very knowledgeable about wine brewing but if you trust me, I can give it a try."

source: 麦格看着埃菲沉默了一会，安慰道：“没关系，不是每一个人都能做到子承父业的。”
en_us: Mag glanced at Eiffie and fell silent for a while. After that, he consoled, "It's alright. Not everyone could take over their father's business."

source: 麦格看着埃菲的表情都不一样了。
en_us: Mag looked at Eiffie with a different expression.

source: 麦格看着埃菲，摇了摇头道：“你的方向错了，这辈子都不可能酿出真正的泰坦酒。”
en_us: Mag looked at Eiffie and said with a shake of his head, "You're going in the wrong direction. You won't be able to brew the real Titan Liquor in your life."

source: 麦格看着埃菲，真诚道：“这是令人觉得不可思议的美酒，酒味醇和，口感甘冽，酒香浓郁且迷人，喝下之后，唇齿留香，令人迷醉。”
en_us: Mag looked at Eiffie and said sincerely, "This is an incredible wine. The taste is mild and it is sweet and cold. The fragrance is very enticing and it lingers in your mouth after drinking it. Very enchanting."

source: 麦格看着城楼上那位身披铠甲的将军，高声道：“多米尼克元帅，我有要事见安德烈国王，事关诺兰大陆安危，请代为转告。”
en_us: Marshal looked at the armored general at the city wall and said loudly, "Marshal Dominic, I need to see King Andre. This concerns the Norland Continent's safety. Please pass the message to him."

source: 麦格看着外边越来越多的客人，眉头微皱，吐槽道：“看来我们酒馆也该招员工了，不然客人都招待不过来了，以后咱们走了，也得找个人把酒馆经营下去才行。”
en_us: Mag looked at the increasing number of customers outside and said with a frown, "It looks like our tavern should start hiring service staff. Otherwise, we won't be able to cope with the number of customers. In the future, when we leave, we also have to find someone to operate the tavern."

source: 麦格看着天边渐渐明亮的鱼肚白，寻觅了整整一夜，还是没有能够找到乔修，这家伙的反侦察能力是最让人头疼的。
en_us: Mag saw the sky slowly turning bright at the horizon. They still couldn't find Josh after searching for the whole night. This fellow's anti-detection ability was giving them a headache.
